MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
// Register: FVR1CON0
#define FVR1CON0 FVR1CON0
extern volatile unsigned char           FVR1CON0            __at(0x090);
#ifndef _LIB_BUILD
asm("FVR1CON0 equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FVRBUFEN               :1;
        unsigned                        :2;
        unsigned FVRBUFSS               :2;
        unsigned FVROE                  :1;
        unsigned FVRRDY                 :1;
        unsigned FVREN                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned FVRBUSS0               :1;
        unsigned FVRBUSS1               :1;
    };
} FVR1CON0bits_t;
extern volatile FVR1CON0bits_t FVR1CON0bits __at(0x090);
// bitfield macros
#define _FVR1CON0_FVRBUFEN_POSN                             0x0
#define _FVR1CON0_FVRBUFEN_POSITION                         0x0
#define _FVR1CON0_FVRBUFEN_SIZE                             0x1
#define _FVR1CON0_FVRBUFEN_LENGTH                           0x1
#define _FVR1CON0_FVRBUFEN_MASK                             0x1
#define _FVR1CON0_FVRBUFSS_POSN                             0x3
#define _FVR1CON0_FVRBUFSS_POSITION                         0x3
#define _FVR1CON0_FVRBUFSS_SIZE                             0x2
#define _FVR1CON0_FVRBUFSS_LENGTH                           0x2
#define _FVR1CON0_FVRBUFSS_MASK                             0x18
#define _FVR1CON0_FVROE_POSN                                0x5
#define _FVR1CON0_FVROE_POSITION                            0x5
#define _FVR1CON0_FVROE_SIZE                                0x1
#define _FVR1CON0_FVROE_LENGTH                              0x1
#define _FVR1CON0_FVROE_MASK                                0x20
#define _FVR1CON0_FVRRDY_POSN                               0x6
#define _FVR1CON0_FVRRDY_POSITION                           0x6
#define _FVR1CON0_FVRRDY_SIZE                               0x1
#define _FVR1CON0_FVRRDY_LENGTH                             0x1
#define _FVR1CON0_FVRRDY_MASK                               0x40
#define _FVR1CON0_FVREN_POSN                                0x7
#define _FVR1CON0_FVREN_POSITION                            0x7
#define _FVR1CON0_FVREN_SIZE                                0x1
#define _FVR1CON0_FVREN_LENGTH                              0x1
#define _FVR1CON0_FVREN_MASK                                0x80
#define _FVR1CON0_FVRBUSS0_POSN                             0x3
#define _FVR1CON0_FVRBUSS0_POSITION                         0x3
#define _FVR1CON0_FVRBUSS0_SIZE                             0x1
#define _FVR1CON0_FVRBUSS0_LENGTH                           0x1
#define _FVR1CON0_FVRBUSS0_MASK                             0x8
#define _FVR1CON0_FVRBUSS1_POSN                             0x4
#define _FVR1CON0_FVRBUSS1_POSITION                         0x4
#define _FVR1CON0_FVRBUSS1_SIZE                             0x1
#define _FVR1CON0_FVRBUSS1_LENGTH                           0x1
#define _FVR1CON0_FVRBUSS1_MASK                             0x10

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
extern volatile unsigned char           DAC1CON0            __at(0x091);
#ifndef _LIB_BUILD
asm("DAC1CON0 equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned DACPSS                 :2;
        unsigned                        :1;
        unsigned DACOE                  :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
    };
} DAC1CON0bits_t;
extern volatile DAC1CON0bits_t DAC1CON0bits __at(0x091);
// bitfield macros
#define _DAC1CON0_DACPSS_POSN                               0x2
#define _DAC1CON0_DACPSS_POSITION                           0x2
#define _DAC1CON0_DACPSS_SIZE                               0x2
#define _DAC1CON0_DACPSS_LENGTH                             0x2
#define _DAC1CON0_DACPSS_MASK                               0xC
#define _DAC1CON0_DACOE_POSN                                0x5
#define _DAC1CON0_DACOE_POSITION                            0x5
#define _DAC1CON0_DACOE_SIZE                                0x1
#define _DAC1CON0_DACOE_LENGTH                              0x1
#define _DAC1CON0_DACOE_MASK                                0x20
#define _DAC1CON0_DACFM_POSN                                0x6
#define _DAC1CON0_DACFM_POSITION                            0x6
#define _DAC1CON0_DACFM_SIZE                                0x1
#define _DAC1CON0_DACFM_LENGTH                              0x1
#define _DAC1CON0_DACFM_MASK                                0x40
#define _DAC1CON0_DACEN_POSN                                0x7
#define _DAC1CON0_DACEN_POSITION                            0x7
#define _DAC1CON0_DACEN_SIZE                                0x1
#define _DAC1CON0_DACEN_LENGTH                              0x1
#define _DAC1CON0_DACEN_MASK                                0x80
#define _DAC1CON0_DACPSS0_POSN                              0x2
#define _DAC1CON0_DACPSS0_POSITION                          0x2
#define _DAC1CON0_DACPSS0_SIZE                              0x1
#define _DAC1CON0_DACPSS0_LENGTH                            0x1
#define _DAC1CON0_DACPSS0_MASK                              0x4
#define _DAC1CON0_DACPSS1_POSN                              0x3
#define _DAC1CON0_DACPSS1_POSITION                          0x3
#define _DAC1CON0_DACPSS1_SIZE                              0x1
#define _DAC1CON0_DACPSS1_LENGTH                            0x1
#define _DAC1CON0_DACPSS1_MASK                              0x8

// Register: DAC1REFL
#define DAC1REFL DAC1REFL
extern volatile unsigned char           DAC1REFL            __at(0x092);
#ifndef _LIB_BUILD
asm("DAC1REFL equ 092h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :8;
    };
} DAC1REFLbits_t;
extern volatile DAC1REFLbits_t DAC1REFLbits __at(0x092);
// bitfield macros
#define _DAC1REFL_DACR_POSN                                 0x0
#define _DAC1REFL_DACR_POSITION                             0x0
#define _DAC1REFL_DACR_SIZE                                 0x8
#define _DAC1REFL_DACR_LENGTH                               0x8
#define _DAC1REFL_DACR_MASK                                 0xFF

// Register: DAC1REFH
#define DAC1REFH DAC1REFH
extern volatile unsigned char           DAC1REFH            __at(0x093);
#ifndef _LIB_BUILD
asm("DAC1REFH equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :8;
    };
} DAC1REFHbits_t;
extern volatile DAC1REFHbits_t DAC1REFHbits __at(0x093);
// bitfield macros
#define _DAC1REFH_DACR_POSN                                 0x0
#define _DAC1REFH_DACR_POSITION                             0x0
#define _DAC1REFH_DACR_SIZE                                 0x8
#define _DAC1REFH_DACR_LENGTH                               0x8
#define _DAC1REFH_DACR_MASK                                 0xFF

