MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x096);
#ifndef _LIB_BUILD
asm("OPA1CON equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA1PCH                :2;
        unsigned OPA1NCH                :2;
        unsigned OPAUGM                 :1;
        unsigned                        :2;
        unsigned OPAEN                  :1;
    };
    struct {
        unsigned OPA1PCH0               :1;
        unsigned OPA1PCH1               :1;
        unsigned OPA1NCH0               :1;
        unsigned OPA1NCH1               :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x096);
// bitfield macros
#define _OPA1CON_OPA1PCH_POSN                               0x0
#define _OPA1CON_OPA1PCH_POSITION                           0x0
#define _OPA1CON_OPA1PCH_SIZE                               0x2
#define _OPA1CON_OPA1PCH_LENGTH                             0x2
#define _OPA1CON_OPA1PCH_MASK                               0x3
#define _OPA1CON_OPA1NCH_POSN                               0x2
#define _OPA1CON_OPA1NCH_POSITION                           0x2
#define _OPA1CON_OPA1NCH_SIZE                               0x2
#define _OPA1CON_OPA1NCH_LENGTH                             0x2
#define _OPA1CON_OPA1NCH_MASK                               0xC
#define _OPA1CON_OPAUGM_POSN                                0x4
#define _OPA1CON_OPAUGM_POSITION                            0x4
#define _OPA1CON_OPAUGM_SIZE                                0x1
#define _OPA1CON_OPAUGM_LENGTH                              0x1
#define _OPA1CON_OPAUGM_MASK                                0x10
#define _OPA1CON_OPAEN_POSN                                 0x7
#define _OPA1CON_OPAEN_POSITION                             0x7
#define _OPA1CON_OPAEN_SIZE                                 0x1
#define _OPA1CON_OPAEN_LENGTH                               0x1
#define _OPA1CON_OPAEN_MASK                                 0x80
#define _OPA1CON_OPA1PCH0_POSN                              0x0
#define _OPA1CON_OPA1PCH0_POSITION                          0x0
#define _OPA1CON_OPA1PCH0_SIZE                              0x1
#define _OPA1CON_OPA1PCH0_LENGTH                            0x1
#define _OPA1CON_OPA1PCH0_MASK                              0x1
#define _OPA1CON_OPA1PCH1_POSN                              0x1
#define _OPA1CON_OPA1PCH1_POSITION                          0x1
#define _OPA1CON_OPA1PCH1_SIZE                              0x1
#define _OPA1CON_OPA1PCH1_LENGTH                            0x1
#define _OPA1CON_OPA1PCH1_MASK                              0x2
#define _OPA1CON_OPA1NCH0_POSN                              0x2
#define _OPA1CON_OPA1NCH0_POSITION                          0x2
#define _OPA1CON_OPA1NCH0_SIZE                              0x1
#define _OPA1CON_OPA1NCH0_LENGTH                            0x1
#define _OPA1CON_OPA1NCH0_MASK                              0x4
#define _OPA1CON_OPA1NCH1_POSN                              0x3
#define _OPA1CON_OPA1NCH1_POSITION                          0x3
#define _OPA1CON_OPA1NCH1_SIZE                              0x1
#define _OPA1CON_OPA1NCH1_LENGTH                            0x1
#define _OPA1CON_OPA1NCH1_MASK                              0x8

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x09B);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 09Bh");
#endif
// aliases
extern volatile unsigned char           C2CON0              __at(0x09B);
#ifndef _LIB_BUILD
asm("C2CON0 equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned C2SP                   :1;
        unsigned C2ZLF                  :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x09B);
// bitfield macros
#define _CM2CON0_C2SYNC_POSN                                0x0
#define _CM2CON0_C2SYNC_POSITION                            0x0
#define _CM2CON0_C2SYNC_SIZE                                0x1
#define _CM2CON0_C2SYNC_LENGTH                              0x1
#define _CM2CON0_C2SYNC_MASK                                0x1
#define _CM2CON0_C2HYS_POSN                                 0x1
#define _CM2CON0_C2HYS_POSITION                             0x1
#define _CM2CON0_C2HYS_SIZE                                 0x1
#define _CM2CON0_C2HYS_LENGTH                               0x1
#define _CM2CON0_C2HYS_MASK                                 0x2
#define _CM2CON0_C2SP_POSN                                  0x2
#define _CM2CON0_C2SP_POSITION                              0x2
#define _CM2CON0_C2SP_SIZE                                  0x1
#define _CM2CON0_C2SP_LENGTH                                0x1
#define _CM2CON0_C2SP_MASK                                  0x4
#define _CM2CON0_C2ZLF_POSN                                 0x3
#define _CM2CON0_C2ZLF_POSITION                             0x3
#define _CM2CON0_C2ZLF_SIZE                                 0x1
#define _CM2CON0_C2ZLF_LENGTH                               0x1
#define _CM2CON0_C2ZLF_MASK                                 0x8
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OE_POSN                                  0x5
#define _CM2CON0_C2OE_POSITION                              0x5
#define _CM2CON0_C2OE_SIZE                                  0x1
#define _CM2CON0_C2OE_LENGTH                                0x1
#define _CM2CON0_C2OE_MASK                                  0x20
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2ON_POSN                                  0x7
#define _CM2CON0_C2ON_POSITION                              0x7
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned C2SP                   :1;
        unsigned C2ZLF                  :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
} C2CON0bits_t;
