MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
// Register: HLTPR1
#define HLTPR1 HLTPR1
extern volatile unsigned char           HLTPR1              __at(0x114);
#ifndef _LIB_BUILD
asm("HLTPR1 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLTPR1                 :8;
    };
} HLTPR1bits_t;
extern volatile HLTPR1bits_t HLTPR1bits __at(0x114);
// bitfield macros
#define _HLTPR1_HLTPR1_POSN                                 0x0
#define _HLTPR1_HLTPR1_POSITION                             0x0
#define _HLTPR1_HLTPR1_SIZE                                 0x8
#define _HLTPR1_HLTPR1_LENGTH                               0x8
#define _HLTPR1_HLTPR1_MASK                                 0xFF

// Register: HLT1CON0
#define HLT1CON0 HLT1CON0
extern volatile unsigned char           HLT1CON0            __at(0x115);
#ifndef _LIB_BUILD
asm("HLT1CON0 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H1CKPS                 :2;
        unsigned H1ON                   :1;
        unsigned H1OUTPS                :4;
    };
    struct {
        unsigned H1CKPS0                :1;
        unsigned H1CKPS1                :1;
        unsigned                        :1;
        unsigned H1OUTPS0               :1;
        unsigned H1OUTPS1               :1;
        unsigned H1OUTPS2               :1;
        unsigned H1OUTPS3               :1;
    };
} HLT1CON0bits_t;
extern volatile HLT1CON0bits_t HLT1CON0bits __at(0x115);
// bitfield macros
#define _HLT1CON0_H1CKPS_POSN                               0x0
#define _HLT1CON0_H1CKPS_POSITION                           0x0
#define _HLT1CON0_H1CKPS_SIZE                               0x2
#define _HLT1CON0_H1CKPS_LENGTH                             0x2
#define _HLT1CON0_H1CKPS_MASK                               0x3
#define _HLT1CON0_H1ON_POSN                                 0x2
#define _HLT1CON0_H1ON_POSITION                             0x2
#define _HLT1CON0_H1ON_SIZE                                 0x1
#define _HLT1CON0_H1ON_LENGTH                               0x1
#define _HLT1CON0_H1ON_MASK                                 0x4
#define _HLT1CON0_H1OUTPS_POSN                              0x3
#define _HLT1CON0_H1OUTPS_POSITION                          0x3
#define _HLT1CON0_H1OUTPS_SIZE                              0x4
#define _HLT1CON0_H1OUTPS_LENGTH                            0x4
#define _HLT1CON0_H1OUTPS_MASK                              0x78
#define _HLT1CON0_H1CKPS0_POSN                              0x0
#define _HLT1CON0_H1CKPS0_POSITION                          0x0
#define _HLT1CON0_H1CKPS0_SIZE                              0x1
#define _HLT1CON0_H1CKPS0_LENGTH                            0x1
#define _HLT1CON0_H1CKPS0_MASK                              0x1
#define _HLT1CON0_H1CKPS1_POSN                              0x1
#define _HLT1CON0_H1CKPS1_POSITION                          0x1
#define _HLT1CON0_H1CKPS1_SIZE                              0x1
#define _HLT1CON0_H1CKPS1_LENGTH                            0x1
#define _HLT1CON0_H1CKPS1_MASK                              0x2
#define _HLT1CON0_H1OUTPS0_POSN                             0x3
#define _HLT1CON0_H1OUTPS0_POSITION                         0x3
#define _HLT1CON0_H1OUTPS0_SIZE                             0x1
#define _HLT1CON0_H1OUTPS0_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS0_MASK                             0x8
#define _HLT1CON0_H1OUTPS1_POSN                             0x4
#define _HLT1CON0_H1OUTPS1_POSITION                         0x4
#define _HLT1CON0_H1OUTPS1_SIZE                             0x1
#define _HLT1CON0_H1OUTPS1_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS1_MASK                             0x10
#define _HLT1CON0_H1OUTPS2_POSN                             0x5
#define _HLT1CON0_H1OUTPS2_POSITION                         0x5
#define _HLT1CON0_H1OUTPS2_SIZE                             0x1
#define _HLT1CON0_H1OUTPS2_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS2_MASK                             0x20
#define _HLT1CON0_H1OUTPS3_POSN                             0x6
#define _HLT1CON0_H1OUTPS3_POSITION                         0x6
#define _HLT1CON0_H1OUTPS3_SIZE                             0x1
#define _HLT1CON0_H1OUTPS3_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS3_MASK                             0x40

// Register: HLT1CON1
#define HLT1CON1 HLT1CON1
extern volatile unsigned char           HLT1CON1            __at(0x116);
#ifndef _LIB_BUILD
asm("HLT1CON1 equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H1REREN                :1;
        unsigned H1FEREN                :1;
        unsigned H1ERS                  :3;
        unsigned                        :1;
        unsigned H1RES                  :1;
        unsigned H1FES                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned H1ERS0                 :1;
        unsigned H1ERS1                 :1;
        unsigned H1ERS2                 :1;
    };
} HLT1CON1bits_t;
extern volatile HLT1CON1bits_t HLT1CON1bits __at(0x116);
// bitfield macros
#define _HLT1CON1_H1REREN_POSN                              0x0
#define _HLT1CON1_H1REREN_POSITION                          0x0
#define _HLT1CON1_H1REREN_SIZE                              0x1
#define _HLT1CON1_H1REREN_LENGTH                            0x1
#define _HLT1CON1_H1REREN_MASK                              0x1
#define _HLT1CON1_H1FEREN_POSN                              0x1
#define _HLT1CON1_H1FEREN_POSITION                          0x1
#define _HLT1CON1_H1FEREN_SIZE                              0x1
#define _HLT1CON1_H1FEREN_LENGTH                            0x1
#define _HLT1CON1_H1FEREN_MASK                              0x2
#define _HLT1CON1_H1ERS_POSN                                0x2
#define _HLT1CON1_H1ERS_POSITION                            0x2
#define _HLT1CON1_H1ERS_SIZE                                0x3
#define _HLT1CON1_H1ERS_LENGTH                              0x3
#define _HLT1CON1_H1ERS_MASK                                0x1C
#define _HLT1CON1_H1RES_POSN                                0x6
#define _HLT1CON1_H1RES_POSITION                            0x6
#define _HLT1CON1_H1RES_SIZE                                0x1
#define _HLT1CON1_H1RES_LENGTH                              0x1
#define _HLT1CON1_H1RES_MASK                                0x40
#define _HLT1CON1_H1FES_POSN                                0x7
#define _HLT1CON1_H1FES_POSITION                            0x7
#define _HLT1CON1_H1FES_SIZE                                0x1
#define _HLT1CON1_H1FES_LENGTH                              0x1
#define _HLT1CON1_H1FES_MASK                                0x80
#define _HLT1CON1_H1ERS0_POSN                               0x2
#define _HLT1CON1_H1ERS0_POSITION                           0x2
#define _HLT1CON1_H1ERS0_SIZE                               0x1
#define _HLT1CON1_H1ERS0_LENGTH                             0x1
#define _HLT1CON1_H1ERS0_MASK                               0x4
#define _HLT1CON1_H1ERS1_POSN                               0x3
#define _HLT1CON1_H1ERS1_POSITION                           0x3
#define _HLT1CON1_H1ERS1_SIZE                               0x1
#define _HLT1CON1_H1ERS1_LENGTH                             0x1
#define _HLT1CON1_H1ERS1_MASK                               0x8
#define _HLT1CON1_H1ERS2_POSN                               0x4
#define _HLT1CON1_H1ERS2_POSITION                           0x4
#define _HLT1CON1_H1ERS2_SIZE                               0x1
#define _HLT1CON1_H1ERS2_LENGTH                             0x1
#define _HLT1CON1_H1ERS2_MASK                               0x10

// Register: HLTMR2
#define HLTMR2 HLTMR2
extern volatile unsigned char           HLTMR2              __at(0x117);
#ifndef _LIB_BUILD
asm("HLTMR2 equ 0117h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLTMR2                 :8;
    };
} HLTMR2bits_t;
