MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
extern volatile HLTMR2bits_t HLTMR2bits __at(0x117);
// bitfield macros
#define _HLTMR2_HLTMR2_POSN                                 0x0
#define _HLTMR2_HLTMR2_POSITION                             0x0
#define _HLTMR2_HLTMR2_SIZE                                 0x8
#define _HLTMR2_HLTMR2_LENGTH                               0x8
#define _HLTMR2_HLTMR2_MASK                                 0xFF

// Register: HLTPR2
#define HLTPR2 HLTPR2
extern volatile unsigned char           HLTPR2              __at(0x118);
#ifndef _LIB_BUILD
asm("HLTPR2 equ 0118h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLTPR2                 :8;
    };
} HLTPR2bits_t;
extern volatile HLTPR2bits_t HLTPR2bits __at(0x118);
// bitfield macros
#define _HLTPR2_HLTPR2_POSN                                 0x0
#define _HLTPR2_HLTPR2_POSITION                             0x0
#define _HLTPR2_HLTPR2_SIZE                                 0x8
#define _HLTPR2_HLTPR2_LENGTH                               0x8
#define _HLTPR2_HLTPR2_MASK                                 0xFF

// Register: HLT2CON0
#define HLT2CON0 HLT2CON0
extern volatile unsigned char           HLT2CON0            __at(0x119);
#ifndef _LIB_BUILD
asm("HLT2CON0 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H2CKPS                 :2;
        unsigned H2ON                   :1;
        unsigned H2OUTPS                :4;
    };
    struct {
        unsigned H2CKPS0                :1;
        unsigned H2CKPS1                :1;
        unsigned                        :1;
        unsigned H2OUTPS0               :1;
        unsigned H2OUTPS1               :1;
        unsigned H2OUTPS2               :1;
        unsigned H2OUTPS3               :1;
    };
} HLT2CON0bits_t;
extern volatile HLT2CON0bits_t HLT2CON0bits __at(0x119);
// bitfield macros
#define _HLT2CON0_H2CKPS_POSN                               0x0
#define _HLT2CON0_H2CKPS_POSITION                           0x0
#define _HLT2CON0_H2CKPS_SIZE                               0x2
#define _HLT2CON0_H2CKPS_LENGTH                             0x2
#define _HLT2CON0_H2CKPS_MASK                               0x3
#define _HLT2CON0_H2ON_POSN                                 0x2
#define _HLT2CON0_H2ON_POSITION                             0x2
#define _HLT2CON0_H2ON_SIZE                                 0x1
#define _HLT2CON0_H2ON_LENGTH                               0x1
#define _HLT2CON0_H2ON_MASK                                 0x4
#define _HLT2CON0_H2OUTPS_POSN                              0x3
#define _HLT2CON0_H2OUTPS_POSITION                          0x3
#define _HLT2CON0_H2OUTPS_SIZE                              0x4
#define _HLT2CON0_H2OUTPS_LENGTH                            0x4
#define _HLT2CON0_H2OUTPS_MASK                              0x78
#define _HLT2CON0_H2CKPS0_POSN                              0x0
#define _HLT2CON0_H2CKPS0_POSITION                          0x0
#define _HLT2CON0_H2CKPS0_SIZE                              0x1
#define _HLT2CON0_H2CKPS0_LENGTH                            0x1
#define _HLT2CON0_H2CKPS0_MASK                              0x1
#define _HLT2CON0_H2CKPS1_POSN                              0x1
#define _HLT2CON0_H2CKPS1_POSITION                          0x1
#define _HLT2CON0_H2CKPS1_SIZE                              0x1
#define _HLT2CON0_H2CKPS1_LENGTH                            0x1
#define _HLT2CON0_H2CKPS1_MASK                              0x2
#define _HLT2CON0_H2OUTPS0_POSN                             0x3
#define _HLT2CON0_H2OUTPS0_POSITION                         0x3
#define _HLT2CON0_H2OUTPS0_SIZE                             0x1
#define _HLT2CON0_H2OUTPS0_LENGTH                           0x1
#define _HLT2CON0_H2OUTPS0_MASK                             0x8
#define _HLT2CON0_H2OUTPS1_POSN                             0x4
#define _HLT2CON0_H2OUTPS1_POSITION                         0x4
#define _HLT2CON0_H2OUTPS1_SIZE                             0x1
#define _HLT2CON0_H2OUTPS1_LENGTH                           0x1
#define _HLT2CON0_H2OUTPS1_MASK                             0x10
#define _HLT2CON0_H2OUTPS2_POSN                             0x5
#define _HLT2CON0_H2OUTPS2_POSITION                         0x5
#define _HLT2CON0_H2OUTPS2_SIZE                             0x1
#define _HLT2CON0_H2OUTPS2_LENGTH                           0x1
#define _HLT2CON0_H2OUTPS2_MASK                             0x20
#define _HLT2CON0_H2OUTPS3_POSN                             0x6
#define _HLT2CON0_H2OUTPS3_POSITION                         0x6
#define _HLT2CON0_H2OUTPS3_SIZE                             0x1
#define _HLT2CON0_H2OUTPS3_LENGTH                           0x1
#define _HLT2CON0_H2OUTPS3_MASK                             0x40

// Register: HLT2CON1
#define HLT2CON1 HLT2CON1
extern volatile unsigned char           HLT2CON1            __at(0x11A);
#ifndef _LIB_BUILD
asm("HLT2CON1 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H2REREN                :1;
        unsigned H2FEREN                :1;
        unsigned H2ERS                  :3;
        unsigned                        :1;
        unsigned H2RES                  :1;
        unsigned H2FES                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned H2ERS0                 :1;
        unsigned H2ERS1                 :1;
        unsigned H2ERS2                 :1;
    };
} HLT2CON1bits_t;
extern volatile HLT2CON1bits_t HLT2CON1bits __at(0x11A);
// bitfield macros
#define _HLT2CON1_H2REREN_POSN                              0x0
#define _HLT2CON1_H2REREN_POSITION                          0x0
#define _HLT2CON1_H2REREN_SIZE                              0x1
#define _HLT2CON1_H2REREN_LENGTH                            0x1
#define _HLT2CON1_H2REREN_MASK                              0x1
#define _HLT2CON1_H2FEREN_POSN                              0x1
#define _HLT2CON1_H2FEREN_POSITION                          0x1
#define _HLT2CON1_H2FEREN_SIZE                              0x1
#define _HLT2CON1_H2FEREN_LENGTH                            0x1
#define _HLT2CON1_H2FEREN_MASK                              0x2
#define _HLT2CON1_H2ERS_POSN                                0x2
#define _HLT2CON1_H2ERS_POSITION                            0x2
#define _HLT2CON1_H2ERS_SIZE                                0x3
#define _HLT2CON1_H2ERS_LENGTH                              0x3
#define _HLT2CON1_H2ERS_MASK                                0x1C
#define _HLT2CON1_H2RES_POSN                                0x6
#define _HLT2CON1_H2RES_POSITION                            0x6
#define _HLT2CON1_H2RES_SIZE                                0x1
#define _HLT2CON1_H2RES_LENGTH                              0x1
#define _HLT2CON1_H2RES_MASK                                0x40
#define _HLT2CON1_H2FES_POSN                                0x7
#define _HLT2CON1_H2FES_POSITION                            0x7
#define _HLT2CON1_H2FES_SIZE                                0x1
#define _HLT2CON1_H2FES_LENGTH                              0x1
#define _HLT2CON1_H2FES_MASK                                0x80
#define _HLT2CON1_H2ERS0_POSN                               0x2
#define _HLT2CON1_H2ERS0_POSITION                           0x2
#define _HLT2CON1_H2ERS0_SIZE                               0x1
#define _HLT2CON1_H2ERS0_LENGTH                             0x1
#define _HLT2CON1_H2ERS0_MASK                               0x4
#define _HLT2CON1_H2ERS1_POSN                               0x3
#define _HLT2CON1_H2ERS1_POSITION                           0x3
#define _HLT2CON1_H2ERS1_SIZE                               0x1
#define _HLT2CON1_H2ERS1_LENGTH                             0x1
#define _HLT2CON1_H2ERS1_MASK                               0x8
#define _HLT2CON1_H2ERS2_POSN                               0x4
#define _HLT2CON1_H2ERS2_POSITION                           0x4
#define _HLT2CON1_H2ERS2_SIZE                               0x1
#define _HLT2CON1_H2ERS2_LENGTH                             0x1
#define _HLT2CON1_H2ERS2_MASK                               0x10

