MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
// Register: PMDATH
#define PMDATH PMDATH
extern volatile unsigned char           PMDATH              __at(0x191);
#ifndef _LIB_BUILD
asm("PMDATH equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMDATH                 :6;
    };
} PMDATHbits_t;
extern volatile PMDATHbits_t PMDATHbits __at(0x191);
// bitfield macros
#define _PMDATH_PMDATH_POSN                                 0x0
#define _PMDATH_PMDATH_POSITION                             0x0
#define _PMDATH_PMDATH_SIZE                                 0x6
#define _PMDATH_PMDATH_LENGTH                               0x6
#define _PMDATH_PMDATH_MASK                                 0x3F

// Register: COG1PHR
#define COG1PHR COG1PHR
extern volatile unsigned char           COG1PHR             __at(0x192);
#ifndef _LIB_BUILD
asm("COG1PHR equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1PHR                  :4;
    };
    struct {
        unsigned G1PHR0                 :1;
        unsigned G1PHR1                 :1;
        unsigned G1PHR2                 :1;
        unsigned G1PHR3                 :1;
    };
} COG1PHRbits_t;
extern volatile COG1PHRbits_t COG1PHRbits __at(0x192);
// bitfield macros
#define _COG1PHR_G1PHR_POSN                                 0x0
#define _COG1PHR_G1PHR_POSITION                             0x0
#define _COG1PHR_G1PHR_SIZE                                 0x4
#define _COG1PHR_G1PHR_LENGTH                               0x4
#define _COG1PHR_G1PHR_MASK                                 0xF
#define _COG1PHR_G1PHR0_POSN                                0x0
#define _COG1PHR_G1PHR0_POSITION                            0x0
#define _COG1PHR_G1PHR0_SIZE                                0x1
#define _COG1PHR_G1PHR0_LENGTH                              0x1
#define _COG1PHR_G1PHR0_MASK                                0x1
#define _COG1PHR_G1PHR1_POSN                                0x1
#define _COG1PHR_G1PHR1_POSITION                            0x1
#define _COG1PHR_G1PHR1_SIZE                                0x1
#define _COG1PHR_G1PHR1_LENGTH                              0x1
#define _COG1PHR_G1PHR1_MASK                                0x2
#define _COG1PHR_G1PHR2_POSN                                0x2
#define _COG1PHR_G1PHR2_POSITION                            0x2
#define _COG1PHR_G1PHR2_SIZE                                0x1
#define _COG1PHR_G1PHR2_LENGTH                              0x1
#define _COG1PHR_G1PHR2_MASK                                0x4
#define _COG1PHR_G1PHR3_POSN                                0x3
#define _COG1PHR_G1PHR3_POSITION                            0x3
#define _COG1PHR_G1PHR3_SIZE                                0x1
#define _COG1PHR_G1PHR3_LENGTH                              0x1
#define _COG1PHR_G1PHR3_MASK                                0x8

// Register: COG1PHF
#define COG1PHF COG1PHF
extern volatile unsigned char           COG1PHF             __at(0x193);
#ifndef _LIB_BUILD
asm("COG1PHF equ 0193h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1PHF                  :4;
    };
    struct {
        unsigned G1PHF0                 :1;
        unsigned G1PHF1                 :1;
        unsigned G1PHF2                 :1;
        unsigned G1PHF3                 :1;
    };
} COG1PHFbits_t;
extern volatile COG1PHFbits_t COG1PHFbits __at(0x193);
// bitfield macros
#define _COG1PHF_G1PHF_POSN                                 0x0
#define _COG1PHF_G1PHF_POSITION                             0x0
#define _COG1PHF_G1PHF_SIZE                                 0x4
#define _COG1PHF_G1PHF_LENGTH                               0x4
#define _COG1PHF_G1PHF_MASK                                 0xF
#define _COG1PHF_G1PHF0_POSN                                0x0
#define _COG1PHF_G1PHF0_POSITION                            0x0
#define _COG1PHF_G1PHF0_SIZE                                0x1
#define _COG1PHF_G1PHF0_LENGTH                              0x1
#define _COG1PHF_G1PHF0_MASK                                0x1
#define _COG1PHF_G1PHF1_POSN                                0x1
#define _COG1PHF_G1PHF1_POSITION                            0x1
#define _COG1PHF_G1PHF1_SIZE                                0x1
#define _COG1PHF_G1PHF1_LENGTH                              0x1
#define _COG1PHF_G1PHF1_MASK                                0x2
#define _COG1PHF_G1PHF2_POSN                                0x2
#define _COG1PHF_G1PHF2_POSITION                            0x2
#define _COG1PHF_G1PHF2_SIZE                                0x1
#define _COG1PHF_G1PHF2_LENGTH                              0x1
#define _COG1PHF_G1PHF2_MASK                                0x4
#define _COG1PHF_G1PHF3_POSN                                0x3
#define _COG1PHF_G1PHF3_POSITION                            0x3
#define _COG1PHF_G1PHF3_SIZE                                0x1
#define _COG1PHF_G1PHF3_LENGTH                              0x1
#define _COG1PHF_G1PHF3_MASK                                0x8

// Register: COG1BKR
#define COG1BKR COG1BKR
extern volatile unsigned char           COG1BKR             __at(0x194);
#ifndef _LIB_BUILD
asm("COG1BKR equ 0194h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1BKR                  :4;
    };
    struct {
        unsigned G1BKR0                 :1;
        unsigned G1BKR1                 :1;
        unsigned G1BKR2                 :1;
        unsigned G1BKR3                 :1;
    };
} COG1BKRbits_t;
extern volatile COG1BKRbits_t COG1BKRbits __at(0x194);
// bitfield macros
#define _COG1BKR_G1BKR_POSN                                 0x0
#define _COG1BKR_G1BKR_POSITION                             0x0
#define _COG1BKR_G1BKR_SIZE                                 0x4
#define _COG1BKR_G1BKR_LENGTH                               0x4
#define _COG1BKR_G1BKR_MASK                                 0xF
#define _COG1BKR_G1BKR0_POSN                                0x0
#define _COG1BKR_G1BKR0_POSITION                            0x0
#define _COG1BKR_G1BKR0_SIZE                                0x1
#define _COG1BKR_G1BKR0_LENGTH                              0x1
#define _COG1BKR_G1BKR0_MASK                                0x1
#define _COG1BKR_G1BKR1_POSN                                0x1
#define _COG1BKR_G1BKR1_POSITION                            0x1
#define _COG1BKR_G1BKR1_SIZE                                0x1
#define _COG1BKR_G1BKR1_LENGTH                              0x1
#define _COG1BKR_G1BKR1_MASK                                0x2
#define _COG1BKR_G1BKR2_POSN                                0x2
#define _COG1BKR_G1BKR2_POSITION                            0x2
#define _COG1BKR_G1BKR2_SIZE                                0x1
#define _COG1BKR_G1BKR2_LENGTH                              0x1
#define _COG1BKR_G1BKR2_MASK                                0x4
#define _COG1BKR_G1BKR3_POSN                                0x3
#define _COG1BKR_G1BKR3_POSITION                            0x3
#define _COG1BKR_G1BKR3_SIZE                                0x1
#define _COG1BKR_G1BKR3_LENGTH                              0x1
#define _COG1BKR_G1BKR3_MASK                                0x8

// Register: COG1BKF
#define COG1BKF COG1BKF
extern volatile unsigned char           COG1BKF             __at(0x195);
#ifndef _LIB_BUILD
asm("COG1BKF equ 0195h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1BKF                  :4;
    };
    struct {
        unsigned G1BKF0                 :1;
        unsigned G1BKF1                 :1;
        unsigned G1BKF2                 :1;
        unsigned G1BKF3                 :1;
    };
} COG1BKFbits_t;
extern volatile COG1BKFbits_t COG1BKFbits __at(0x195);
// bitfield macros
#define _COG1BKF_G1BKF_POSN                                 0x0
#define _COG1BKF_G1BKF_POSITION                             0x0
#define _COG1BKF_G1BKF_SIZE                                 0x4
#define _COG1BKF_G1BKF_LENGTH                               0x4
#define _COG1BKF_G1BKF_MASK                                 0xF
#define _COG1BKF_G1BKF0_POSN                                0x0
#define _COG1BKF_G1BKF0_POSITION                            0x0
#define _COG1BKF_G1BKF0_SIZE                                0x1
#define _COG1BKF_G1BKF0_LENGTH                              0x1
#define _COG1BKF_G1BKF0_MASK                                0x1
#define _COG1BKF_G1BKF1_POSN                                0x1
#define _COG1BKF_G1BKF1_POSITION                            0x1
#define _COG1BKF_G1BKF1_SIZE                                0x1
#define _COG1BKF_G1BKF1_LENGTH                              0x1
#define _COG1BKF_G1BKF1_MASK                                0x2
#define _COG1BKF_G1BKF2_POSN                                0x2
#define _COG1BKF_G1BKF2_POSITION                            0x2
#define _COG1BKF_G1BKF2_SIZE                                0x1
#define _COG1BKF_G1BKF2_LENGTH                              0x1
#define _COG1BKF_G1BKF2_MASK                                0x4
#define _COG1BKF_G1BKF3_POSN                                0x3
#define _COG1BKF_G1BKF3_POSITION                            0x3
#define _COG1BKF_G1BKF3_SIZE                                0x1
#define _COG1BKF_G1BKF3_LENGTH                              0x1
#define _COG1BKF_G1BKF3_MASK                                0x8

// Register: COG1DBR
#define COG1DBR COG1DBR
extern volatile unsigned char           COG1DBR             __at(0x196);
#ifndef _LIB_BUILD
asm("COG1DBR equ 0196h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1DBR                  :4;
    };
    struct {
        unsigned G1DBR0                 :1;
        unsigned G1DBR1                 :1;
        unsigned G1DBR2                 :1;
        unsigned G1DBR3                 :1;
    };
} COG1DBRbits_t;
extern volatile COG1DBRbits_t COG1DBRbits __at(0x196);
// bitfield macros
#define _COG1DBR_G1DBR_POSN                                 0x0
#define _COG1DBR_G1DBR_POSITION                             0x0
#define _COG1DBR_G1DBR_SIZE                                 0x4
#define _COG1DBR_G1DBR_LENGTH                               0x4
#define _COG1DBR_G1DBR_MASK                                 0xF
#define _COG1DBR_G1DBR0_POSN                                0x0
#define _COG1DBR_G1DBR0_POSITION                            0x0
#define _COG1DBR_G1DBR0_SIZE                                0x1
#define _COG1DBR_G1DBR0_LENGTH                              0x1
#define _COG1DBR_G1DBR0_MASK                                0x1
#define _COG1DBR_G1DBR1_POSN                                0x1
#define _COG1DBR_G1DBR1_POSITION                            0x1
#define _COG1DBR_G1DBR1_SIZE                                0x1
#define _COG1DBR_G1DBR1_LENGTH                              0x1
#define _COG1DBR_G1DBR1_MASK                                0x2
#define _COG1DBR_G1DBR2_POSN                                0x2
#define _COG1DBR_G1DBR2_POSITION                            0x2
#define _COG1DBR_G1DBR2_SIZE                                0x1
#define _COG1DBR_G1DBR2_LENGTH                              0x1
#define _COG1DBR_G1DBR2_MASK                                0x4
#define _COG1DBR_G1DBR3_POSN                                0x3
#define _COG1DBR_G1DBR3_POSITION                            0x3
#define _COG1DBR_G1DBR3_SIZE                                0x1
#define _COG1DBR_G1DBR3_LENGTH                              0x1
#define _COG1DBR_G1DBR3_MASK                                0x8

