MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
// Register: COG1DBF
#define COG1DBF COG1DBF
extern volatile unsigned char           COG1DBF             __at(0x197);
#ifndef _LIB_BUILD
asm("COG1DBF equ 0197h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1DBF                  :4;
    };
    struct {
        unsigned G1DBF0                 :1;
        unsigned G1DBF1                 :1;
        unsigned G1DBF2                 :1;
        unsigned G1DBF3                 :1;
    };
} COG1DBFbits_t;
extern volatile COG1DBFbits_t COG1DBFbits __at(0x197);
// bitfield macros
#define _COG1DBF_G1DBF_POSN                                 0x0
#define _COG1DBF_G1DBF_POSITION                             0x0
#define _COG1DBF_G1DBF_SIZE                                 0x4
#define _COG1DBF_G1DBF_LENGTH                               0x4
#define _COG1DBF_G1DBF_MASK                                 0xF
#define _COG1DBF_G1DBF0_POSN                                0x0
#define _COG1DBF_G1DBF0_POSITION                            0x0
#define _COG1DBF_G1DBF0_SIZE                                0x1
#define _COG1DBF_G1DBF0_LENGTH                              0x1
#define _COG1DBF_G1DBF0_MASK                                0x1
#define _COG1DBF_G1DBF1_POSN                                0x1
#define _COG1DBF_G1DBF1_POSITION                            0x1
#define _COG1DBF_G1DBF1_SIZE                                0x1
#define _COG1DBF_G1DBF1_LENGTH                              0x1
#define _COG1DBF_G1DBF1_MASK                                0x2
#define _COG1DBF_G1DBF2_POSN                                0x2
#define _COG1DBF_G1DBF2_POSITION                            0x2
#define _COG1DBF_G1DBF2_SIZE                                0x1
#define _COG1DBF_G1DBF2_LENGTH                              0x1
#define _COG1DBF_G1DBF2_MASK                                0x4
#define _COG1DBF_G1DBF3_POSN                                0x3
#define _COG1DBF_G1DBF3_POSITION                            0x3
#define _COG1DBF_G1DBF3_SIZE                                0x1
#define _COG1DBF_G1DBF3_LENGTH                              0x1
#define _COG1DBF_G1DBF3_MASK                                0x8

// Register: COG1CON0
#define COG1CON0 COG1CON0
extern volatile unsigned char           COG1CON0            __at(0x198);
#ifndef _LIB_BUILD
asm("COG1CON0 equ 0198h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1MD                   :1;
        unsigned                        :1;
        unsigned G1LD                   :1;
        unsigned G1POL0                 :1;
        unsigned G1POL1                 :1;
        unsigned G1OE0                  :1;
        unsigned G1OE1                  :1;
        unsigned G1EN                   :1;
    };
} COG1CON0bits_t;
extern volatile COG1CON0bits_t COG1CON0bits __at(0x198);
// bitfield macros
#define _COG1CON0_G1MD_POSN                                 0x0
#define _COG1CON0_G1MD_POSITION                             0x0
#define _COG1CON0_G1MD_SIZE                                 0x1
#define _COG1CON0_G1MD_LENGTH                               0x1
#define _COG1CON0_G1MD_MASK                                 0x1
#define _COG1CON0_G1LD_POSN                                 0x2
#define _COG1CON0_G1LD_POSITION                             0x2
#define _COG1CON0_G1LD_SIZE                                 0x1
#define _COG1CON0_G1LD_LENGTH                               0x1
#define _COG1CON0_G1LD_MASK                                 0x4
#define _COG1CON0_G1POL0_POSN                               0x3
#define _COG1CON0_G1POL0_POSITION                           0x3
#define _COG1CON0_G1POL0_SIZE                               0x1
#define _COG1CON0_G1POL0_LENGTH                             0x1
#define _COG1CON0_G1POL0_MASK                               0x8
#define _COG1CON0_G1POL1_POSN                               0x4
#define _COG1CON0_G1POL1_POSITION                           0x4
#define _COG1CON0_G1POL1_SIZE                               0x1
#define _COG1CON0_G1POL1_LENGTH                             0x1
#define _COG1CON0_G1POL1_MASK                               0x10
#define _COG1CON0_G1OE0_POSN                                0x5
#define _COG1CON0_G1OE0_POSITION                            0x5
#define _COG1CON0_G1OE0_SIZE                                0x1
#define _COG1CON0_G1OE0_LENGTH                              0x1
#define _COG1CON0_G1OE0_MASK                                0x20
#define _COG1CON0_G1OE1_POSN                                0x6
#define _COG1CON0_G1OE1_POSITION                            0x6
#define _COG1CON0_G1OE1_SIZE                                0x1
#define _COG1CON0_G1OE1_LENGTH                              0x1
#define _COG1CON0_G1OE1_MASK                                0x40
#define _COG1CON0_G1EN_POSN                                 0x7
#define _COG1CON0_G1EN_POSITION                             0x7
#define _COG1CON0_G1EN_SIZE                                 0x1
#define _COG1CON0_G1EN_LENGTH                               0x1
#define _COG1CON0_G1EN_MASK                                 0x80

// Register: COG1CON1
#define COG1CON1 COG1CON1
extern volatile unsigned char           COG1CON1            __at(0x199);
#ifndef _LIB_BUILD
asm("COG1CON1 equ 0199h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1CS                   :2;
        unsigned                        :4;
        unsigned G1FDBTS                :1;
        unsigned G1RDBTS                :1;
    };
    struct {
        unsigned G1CS0                  :1;
        unsigned G1CS1                  :1;
    };
} COG1CON1bits_t;
extern volatile COG1CON1bits_t COG1CON1bits __at(0x199);
// bitfield macros
#define _COG1CON1_G1CS_POSN                                 0x0
#define _COG1CON1_G1CS_POSITION                             0x0
#define _COG1CON1_G1CS_SIZE                                 0x2
#define _COG1CON1_G1CS_LENGTH                               0x2
#define _COG1CON1_G1CS_MASK                                 0x3
#define _COG1CON1_G1FDBTS_POSN                              0x6
#define _COG1CON1_G1FDBTS_POSITION                          0x6
#define _COG1CON1_G1FDBTS_SIZE                              0x1
#define _COG1CON1_G1FDBTS_LENGTH                            0x1
#define _COG1CON1_G1FDBTS_MASK                              0x40
#define _COG1CON1_G1RDBTS_POSN                              0x7
#define _COG1CON1_G1RDBTS_POSITION                          0x7
#define _COG1CON1_G1RDBTS_SIZE                              0x1
#define _COG1CON1_G1RDBTS_LENGTH                            0x1
#define _COG1CON1_G1RDBTS_MASK                              0x80
#define _COG1CON1_G1CS0_POSN                                0x0
#define _COG1CON1_G1CS0_POSITION                            0x0
#define _COG1CON1_G1CS0_SIZE                                0x1
#define _COG1CON1_G1CS0_LENGTH                              0x1
#define _COG1CON1_G1CS0_MASK                                0x1
#define _COG1CON1_G1CS1_POSN                                0x1
#define _COG1CON1_G1CS1_POSITION                            0x1
#define _COG1CON1_G1CS1_SIZE                                0x1
#define _COG1CON1_G1CS1_LENGTH                              0x1
#define _COG1CON1_G1CS1_MASK                                0x2

// Register: COG1RIS
#define COG1RIS COG1RIS
extern volatile unsigned char           COG1RIS             __at(0x19A);
#ifndef _LIB_BUILD
asm("COG1RIS equ 019Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1RIC1                 :1;
        unsigned G1RIC2                 :1;
        unsigned C1RICCP1               :1;
        unsigned G1RIFLT                :1;
        unsigned G1RIT2M                :1;
        unsigned G1R1HLT1               :1;
        unsigned G1RIHLT2               :1;
    };
} COG1RISbits_t;
extern volatile COG1RISbits_t COG1RISbits __at(0x19A);
// bitfield macros
#define _COG1RIS_G1RIC1_POSN                                0x0
#define _COG1RIS_G1RIC1_POSITION                            0x0
#define _COG1RIS_G1RIC1_SIZE                                0x1
#define _COG1RIS_G1RIC1_LENGTH                              0x1
#define _COG1RIS_G1RIC1_MASK                                0x1
#define _COG1RIS_G1RIC2_POSN                                0x1
#define _COG1RIS_G1RIC2_POSITION                            0x1
#define _COG1RIS_G1RIC2_SIZE                                0x1
#define _COG1RIS_G1RIC2_LENGTH                              0x1
#define _COG1RIS_G1RIC2_MASK                                0x2
#define _COG1RIS_C1RICCP1_POSN                              0x2
#define _COG1RIS_C1RICCP1_POSITION                          0x2
#define _COG1RIS_C1RICCP1_SIZE                              0x1
#define _COG1RIS_C1RICCP1_LENGTH                            0x1
#define _COG1RIS_C1RICCP1_MASK                              0x4
#define _COG1RIS_G1RIFLT_POSN                               0x3
#define _COG1RIS_G1RIFLT_POSITION                           0x3
#define _COG1RIS_G1RIFLT_SIZE                               0x1
#define _COG1RIS_G1RIFLT_LENGTH                             0x1
#define _COG1RIS_G1RIFLT_MASK                               0x8
#define _COG1RIS_G1RIT2M_POSN                               0x4
#define _COG1RIS_G1RIT2M_POSITION                           0x4
#define _COG1RIS_G1RIT2M_SIZE                               0x1
#define _COG1RIS_G1RIT2M_LENGTH                             0x1
#define _COG1RIS_G1RIT2M_MASK                               0x10
#define _COG1RIS_G1R1HLT1_POSN                              0x5
#define _COG1RIS_G1R1HLT1_POSITION                          0x5
#define _COG1RIS_G1R1HLT1_SIZE                              0x1
#define _COG1RIS_G1R1HLT1_LENGTH                            0x1
#define _COG1RIS_G1R1HLT1_MASK                              0x20
#define _COG1RIS_G1RIHLT2_POSN                              0x6
#define _COG1RIS_G1RIHLT2_POSITION                          0x6
#define _COG1RIS_G1RIHLT2_SIZE                              0x1
#define _COG1RIS_G1RIHLT2_LENGTH                            0x1
#define _COG1RIS_G1RIHLT2_MASK                              0x40

// Register: COG1RSIM
#define COG1RSIM COG1RSIM
extern volatile unsigned char           COG1RSIM            __at(0x19B);
#ifndef _LIB_BUILD
asm("COG1RSIM equ 019Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1RMC1                 :1;
        unsigned G1RMC2                 :1;
        unsigned G1RMCCP1               :1;
        unsigned G1RMFLT                :1;
        unsigned G1RTM2M                :1;
        unsigned G1RMHLT1               :1;
        unsigned G1RMHLT2               :1;
    };
} COG1RSIMbits_t;
extern volatile COG1RSIMbits_t COG1RSIMbits __at(0x19B);
// bitfield macros
#define _COG1RSIM_G1RMC1_POSN                               0x0
#define _COG1RSIM_G1RMC1_POSITION                           0x0
#define _COG1RSIM_G1RMC1_SIZE                               0x1
#define _COG1RSIM_G1RMC1_LENGTH                             0x1
#define _COG1RSIM_G1RMC1_MASK                               0x1
#define _COG1RSIM_G1RMC2_POSN                               0x1
#define _COG1RSIM_G1RMC2_POSITION                           0x1
#define _COG1RSIM_G1RMC2_SIZE                               0x1
#define _COG1RSIM_G1RMC2_LENGTH                             0x1
#define _COG1RSIM_G1RMC2_MASK                               0x2
#define _COG1RSIM_G1RMCCP1_POSN                             0x2
#define _COG1RSIM_G1RMCCP1_POSITION                         0x2
#define _COG1RSIM_G1RMCCP1_SIZE                             0x1
#define _COG1RSIM_G1RMCCP1_LENGTH                           0x1
#define _COG1RSIM_G1RMCCP1_MASK                             0x4
#define _COG1RSIM_G1RMFLT_POSN                              0x3
#define _COG1RSIM_G1RMFLT_POSITION                          0x3
#define _COG1RSIM_G1RMFLT_SIZE                              0x1
#define _COG1RSIM_G1RMFLT_LENGTH                            0x1
#define _COG1RSIM_G1RMFLT_MASK                              0x8
#define _COG1RSIM_G1RTM2M_POSN                              0x4
#define _COG1RSIM_G1RTM2M_POSITION                          0x4
#define _COG1RSIM_G1RTM2M_SIZE                              0x1
#define _COG1RSIM_G1RTM2M_LENGTH                            0x1
#define _COG1RSIM_G1RTM2M_MASK                              0x10
#define _COG1RSIM_G1RMHLT1_POSN                             0x5
#define _COG1RSIM_G1RMHLT1_POSITION                         0x5
#define _COG1RSIM_G1RMHLT1_SIZE                             0x1
#define _COG1RSIM_G1RMHLT1_LENGTH                           0x1
#define _COG1RSIM_G1RMHLT1_MASK                             0x20
#define _COG1RSIM_G1RMHLT2_POSN                             0x6
#define _COG1RSIM_G1RMHLT2_POSITION                         0x6
#define _COG1RSIM_G1RMHLT2_SIZE                             0x1
#define _COG1RSIM_G1RMHLT2_LENGTH                           0x1
#define _COG1RSIM_G1RMHLT2_MASK                             0x40

// Register: COG1FIS
#define COG1FIS COG1FIS
extern volatile unsigned char           COG1FIS             __at(0x19C);
#ifndef _LIB_BUILD
asm("COG1FIS equ 019Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1FIC1                 :1;
        unsigned G1FIC2                 :1;
        unsigned G1FICCP1               :1;
        unsigned G1FIFLT                :1;
        unsigned G1FIT2M                :1;
        unsigned G1FIHLT1               :1;
        unsigned G1FIHLT2               :1;
    };
} COG1FISbits_t;
extern volatile COG1FISbits_t COG1FISbits __at(0x19C);
// bitfield macros
#define _COG1FIS_G1FIC1_POSN                                0x0
#define _COG1FIS_G1FIC1_POSITION                            0x0
#define _COG1FIS_G1FIC1_SIZE                                0x1
#define _COG1FIS_G1FIC1_LENGTH                              0x1
#define _COG1FIS_G1FIC1_MASK                                0x1
#define _COG1FIS_G1FIC2_POSN                                0x1
#define _COG1FIS_G1FIC2_POSITION                            0x1
#define _COG1FIS_G1FIC2_SIZE                                0x1
#define _COG1FIS_G1FIC2_LENGTH                              0x1
#define _COG1FIS_G1FIC2_MASK                                0x2
#define _COG1FIS_G1FICCP1_POSN                              0x2
#define _COG1FIS_G1FICCP1_POSITION                          0x2
#define _COG1FIS_G1FICCP1_SIZE                              0x1
#define _COG1FIS_G1FICCP1_LENGTH                            0x1
#define _COG1FIS_G1FICCP1_MASK                              0x4
#define _COG1FIS_G1FIFLT_POSN                               0x3
#define _COG1FIS_G1FIFLT_POSITION                           0x3
#define _COG1FIS_G1FIFLT_SIZE                               0x1
#define _COG1FIS_G1FIFLT_LENGTH                             0x1
#define _COG1FIS_G1FIFLT_MASK                               0x8
#define _COG1FIS_G1FIT2M_POSN                               0x4
#define _COG1FIS_G1FIT2M_POSITION                           0x4
#define _COG1FIS_G1FIT2M_SIZE                               0x1
#define _COG1FIS_G1FIT2M_LENGTH                             0x1
#define _COG1FIS_G1FIT2M_MASK                               0x10
#define _COG1FIS_G1FIHLT1_POSN                              0x5
#define _COG1FIS_G1FIHLT1_POSITION                          0x5
#define _COG1FIS_G1FIHLT1_SIZE                              0x1
#define _COG1FIS_G1FIHLT1_LENGTH                            0x1
#define _COG1FIS_G1FIHLT1_MASK                              0x20
#define _COG1FIS_G1FIHLT2_POSN                              0x6
#define _COG1FIS_G1FIHLT2_POSITION                          0x6
#define _COG1FIS_G1FIHLT2_SIZE                              0x1
#define _COG1FIS_G1FIHLT2_LENGTH                            0x1
#define _COG1FIS_G1FIHLT2_MASK                              0x40

// Register: COG1FSIM
#define COG1FSIM COG1FSIM
extern volatile unsigned char           COG1FSIM            __at(0x19D);
#ifndef _LIB_BUILD
asm("COG1FSIM equ 019Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1FMC1                 :1;
        unsigned G1FMC2                 :1;
        unsigned G1FMCCP1               :1;
        unsigned G1FMFLT                :1;
        unsigned G1FMT2M                :1;
        unsigned G1FMHLT1               :1;
        unsigned G1FMHLT2               :1;
    };
} COG1FSIMbits_t;
