MikroElektronika/core_packages/PIC/XC8/def/PIC16HV753/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0xF7);	// @ (0x1E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADCON1,0)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC28);	// @ (0x185 * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC29);	// @ (0x185 * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC2A);	// @ (0x185 * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC2C);	// @ (0x185 * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELC<ANSC0>
extern volatile __bit                   ANSC0               __at(0xC38);	// @ (0x187 * 8 + 0)
#define                                 ANSC0_bit           _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSC1>
extern volatile __bit                   ANSC1               __at(0xC39);	// @ (0x187 * 8 + 1)
#define                                 ANSC1_bit           _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0xC3A);	// @ (0x187 * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC3>
extern volatile __bit                   ANSC3               __at(0xC3B);	// @ (0x187 * 8 + 3)
#define                                 ANSC3_bit           _BIT_ACCESS(ANSELC,3)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,6)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1CON1,1)
// CM1CON1<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1CON1,2)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x4F3);	// @ (0x9E * 8 + 3)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1CON1,3)
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1CON1,4)
// CM1CON1<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1CON1,5)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// COG1RIS<C1RICCP1>
extern volatile __bit                   C1RICCP1            __at(0xCD2);	// @ (0x19A * 8 + 2)
#define                                 C1RICCP1_bit        _BIT_ACCESS(COG1RIS,2)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1ZLF>
extern volatile __bit                   C1ZLF               __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 C1ZLF_bit           _BIT_ACCESS(CM1CON0,3)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,5)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,6)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x4E1);	// @ (0x9C * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2CON1,1)
// CM2CON1<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2CON1,2)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x4DD);	// @ (0x9B * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON1<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2CON1,3)
// CM2CON1<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON1<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2CON1,5)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x4DC);	// @ (0x9B * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2ZLF>
extern volatile __bit                   C2ZLF               __at(0x4DB);	// @ (0x9B * 8 + 3)
#define                                 C2ZLF_bit           _BIT_ACCESS(CM2CON0,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE2<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x68);	// @ (0xD * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR2,0)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xF3);	// @ (0x1E * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xF4);	// @ (0x1E * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0xF5);	// @ (0x1E * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// PIE2<COG1IE>
extern volatile __bit                   COG1IE              __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 COG1IE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<COG1IF>
extern volatile __bit                   COG1IF              __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR2,2)
// DAC1CON0<DACEN>
extern volatile __bit                   DACEN               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DACFM>
extern volatile __bit                   DACFM               __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 DACFM_bit           _BIT_ACCESS(DAC1CON0,6)
// DAC1CON0<DACOE>
extern volatile __bit                   DACOE               __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(DAC1CON0,3)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// FVR1CON0<FVRBUFEN>
extern volatile __bit                   FVRBUFEN            __at(0x480);	// @ (0x90 * 8 + 0)
#define                                 FVRBUFEN_bit        _BIT_ACCESS(FVR1CON0,0)
// FVR1CON0<FVRBUSS0>
extern volatile __bit                   FVRBUSS0            __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 FVRBUSS0_bit        _BIT_ACCESS(FVR1CON0,3)
// FVR1CON0<FVRBUSS1>
extern volatile __bit                   FVRBUSS1            __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 FVRBUSS1_bit        _BIT_ACCESS(FVR1CON0,4)
// FVR1CON0<FVREN>
extern volatile __bit                   FVREN               __at(0x487);	// @ (0x90 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVR1CON0,7)
// FVR1CON0<FVROE>
extern volatile __bit                   FVROE               __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 FVROE_bit           _BIT_ACCESS(FVR1CON0,5)
// FVR1CON0<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x486);	// @ (0x90 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVR1CON0,6)
// COG1ASD0<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0xCF6);	// @ (0x19E * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1ASD0<G1ASD0L0>
extern volatile __bit                   G1ASD0L0            __at(0xCF2);	// @ (0x19E * 8 + 2)
#define                                 G1ASD0L0_bit        _BIT_ACCESS(COG1ASD0,2)
// COG1ASD0<G1ASD0L1>
extern volatile __bit                   G1ASD0L1            __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 G1ASD0L1_bit        _BIT_ACCESS(COG1ASD0,3)
// COG1ASD0<G1ASD1L0>
extern volatile __bit                   G1ASD1L0            __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 G1ASD1L0_bit        _BIT_ACCESS(COG1ASD0,4)
// COG1ASD0<G1ASD1L1>
extern volatile __bit                   G1ASD1L1            __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 G1ASD1L1_bit        _BIT_ACCESS(COG1ASD0,5)
// COG1ASD0<G1ASDE>
extern volatile __bit                   G1ASDE              __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 G1ASDE_bit          _BIT_ACCESS(COG1ASD0,7)
// COG1ASD1<G1ASDSC1>
extern volatile __bit                   G1ASDSC1            __at(0xCF9);	// @ (0x19F * 8 + 1)
#define                                 G1ASDSC1_bit        _BIT_ACCESS(COG1ASD1,1)
// COG1ASD1<G1ASDSC2>
extern volatile __bit                   G1ASDSC2            __at(0xCFA);	// @ (0x19F * 8 + 2)
#define                                 G1ASDSC2_bit        _BIT_ACCESS(COG1ASD1,2)
// COG1ASD1<G1ASDSFLT>
extern volatile __bit                   G1ASDSFLT           __at(0xCF8);	// @ (0x19F * 8 + 0)
#define                                 G1ASDSFLT_bit       _BIT_ACCESS(COG1ASD1,0)
// COG1ASD1<G1ASDSHLT1>
extern volatile __bit                   G1ASDSHLT1          __at(0xCFB);	// @ (0x19F * 8 + 3)
#define                                 G1ASDSHLT1_bit      _BIT_ACCESS(COG1ASD1,3)
// COG1ASD1<G1ASDSHLT2>
extern volatile __bit                   G1ASDSHLT2          __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 G1ASDSHLT2_bit      _BIT_ACCESS(COG1ASD1,4)
// COG1BKF<G1BKF0>
extern volatile __bit                   G1BKF0              __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 G1BKF0_bit          _BIT_ACCESS(COG1BKF,0)
// COG1BKF<G1BKF1>
extern volatile __bit                   G1BKF1              __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 G1BKF1_bit          _BIT_ACCESS(COG1BKF,1)
// COG1BKF<G1BKF2>
extern volatile __bit                   G1BKF2              __at(0xCAA);	// @ (0x195 * 8 + 2)
#define                                 G1BKF2_bit          _BIT_ACCESS(COG1BKF,2)
// COG1BKF<G1BKF3>
extern volatile __bit                   G1BKF3              __at(0xCAB);	// @ (0x195 * 8 + 3)
#define                                 G1BKF3_bit          _BIT_ACCESS(COG1BKF,3)
// COG1BKR<G1BKR0>
extern volatile __bit                   G1BKR0              __at(0xCA0);	// @ (0x194 * 8 + 0)
#define                                 G1BKR0_bit          _BIT_ACCESS(COG1BKR,0)
// COG1BKR<G1BKR1>
extern volatile __bit                   G1BKR1              __at(0xCA1);	// @ (0x194 * 8 + 1)
#define                                 G1BKR1_bit          _BIT_ACCESS(COG1BKR,1)
// COG1BKR<G1BKR2>
extern volatile __bit                   G1BKR2              __at(0xCA2);	// @ (0x194 * 8 + 2)
#define                                 G1BKR2_bit          _BIT_ACCESS(COG1BKR,2)
// COG1BKR<G1BKR3>
extern volatile __bit                   G1BKR3              __at(0xCA3);	// @ (0x194 * 8 + 3)
#define                                 G1BKR3_bit          _BIT_ACCESS(COG1BKR,3)
// COG1CON1<G1CS0>
extern volatile __bit                   G1CS0               __at(0xCC8);	// @ (0x199 * 8 + 0)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON1,0)
// COG1CON1<G1CS1>
extern volatile __bit                   G1CS1               __at(0xCC9);	// @ (0x199 * 8 + 1)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON1,1)
// COG1DBF<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DBF,0)
// COG1DBF<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DBF,1)
// COG1DBF<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0xCBA);	// @ (0x197 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DBF,2)
// COG1DBF<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0xCBB);	// @ (0x197 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DBF,3)
// COG1DBR<G1DBR0>
extern volatile __bit                   G1DBR0              __at(0xCB0);	// @ (0x196 * 8 + 0)
#define                                 G1DBR0_bit          _BIT_ACCESS(COG1DBR,0)
// COG1DBR<G1DBR1>
extern volatile __bit                   G1DBR1              __at(0xCB1);	// @ (0x196 * 8 + 1)
#define                                 G1DBR1_bit          _BIT_ACCESS(COG1DBR,1)
// COG1DBR<G1DBR2>
extern volatile __bit                   G1DBR2              __at(0xCB2);	// @ (0x196 * 8 + 2)
#define                                 G1DBR2_bit          _BIT_ACCESS(COG1DBR,2)
// COG1DBR<G1DBR3>
extern volatile __bit                   G1DBR3              __at(0xCB3);	// @ (0x196 * 8 + 3)
#define                                 G1DBR3_bit          _BIT_ACCESS(COG1DBR,3)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0xCC7);	// @ (0x198 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FDBTS>
extern volatile __bit                   G1FDBTS             __at(0xCCE);	// @ (0x199 * 8 + 6)
#define                                 G1FDBTS_bit         _BIT_ACCESS(COG1CON1,6)
// COG1FIS<G1FIC1>
extern volatile __bit                   G1FIC1              __at(0xCE0);	// @ (0x19C * 8 + 0)
#define                                 G1FIC1_bit          _BIT_ACCESS(COG1FIS,0)
// COG1FIS<G1FIC2>
extern volatile __bit                   G1FIC2              __at(0xCE1);	// @ (0x19C * 8 + 1)
#define                                 G1FIC2_bit          _BIT_ACCESS(COG1FIS,1)
// COG1FIS<G1FICCP1>
extern volatile __bit                   G1FICCP1            __at(0xCE2);	// @ (0x19C * 8 + 2)
#define                                 G1FICCP1_bit        _BIT_ACCESS(COG1FIS,2)
// COG1FIS<G1FIFLT>
extern volatile __bit                   G1FIFLT             __at(0xCE3);	// @ (0x19C * 8 + 3)
#define                                 G1FIFLT_bit         _BIT_ACCESS(COG1FIS,3)
// COG1FIS<G1FIHLT1>
extern volatile __bit                   G1FIHLT1            __at(0xCE5);	// @ (0x19C * 8 + 5)
#define                                 G1FIHLT1_bit        _BIT_ACCESS(COG1FIS,5)
// COG1FIS<G1FIHLT2>
extern volatile __bit                   G1FIHLT2            __at(0xCE6);	// @ (0x19C * 8 + 6)
#define                                 G1FIHLT2_bit        _BIT_ACCESS(COG1FIS,6)
// COG1FIS<G1FIT2M>
extern volatile __bit                   G1FIT2M             __at(0xCE4);	// @ (0x19C * 8 + 4)
#define                                 G1FIT2M_bit         _BIT_ACCESS(COG1FIS,4)
// COG1FSIM<G1FMC1>
extern volatile __bit                   G1FMC1              __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 G1FMC1_bit          _BIT_ACCESS(COG1FSIM,0)
// COG1FSIM<G1FMC2>
extern volatile __bit                   G1FMC2              __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 G1FMC2_bit          _BIT_ACCESS(COG1FSIM,1)
// COG1FSIM<G1FMCCP1>
extern volatile __bit                   G1FMCCP1            __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 G1FMCCP1_bit        _BIT_ACCESS(COG1FSIM,2)
// COG1FSIM<G1FMFLT>
extern volatile __bit                   G1FMFLT             __at(0xCEB);	// @ (0x19D * 8 + 3)
